In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\ABHISHEK YADAV\Downloads\employee_salary_dataset.csv")
a=df.groupby('Department')
# for i,j in a:
    # print(i)
    # print(j)
y=a['Monthly_Salary'].sum()
y
# z=pd.DataFrame(a)
# z
# z
# k=z('Monthly_Salary').count()
# k

a=df.groupby('Department')
a
df

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752

In [4]:
for i,j in a:
    print(i)
    print(j)

Finance
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
5            6   Employee_6    Finance                 3     High School   50
13          14  Employee_14    Finance                 6        Bachelor   27
15          16  Employee_16    Finance                 4     High School   49
20          21  Employee_21    Finance                 4          Master   46
27          28  Employee_28    Finance                16          Master   29
39          40  Employee_40    Finance                12        Bachelor   38
43          44  Employee_44    Finance                17          Master   44
44          45  Employee_45    Finance                 8          Master   53
46          47  Employee_47    Finance                 3          Master   22
48          49  Employee_49    Finance                 5             PhD   23

    Gender       City  Monthly_Salary
5     Male     Mumbai           65818
13    Male      Delhi           28436
15  Female      Delhi          101213
20  Female      Delhi           73404
27  Female  Hyderabad          118179
39  Female     Mumbai           68484
43    Male  Hyderabad           72202
44    Male      Delhi           57635
46  Female      Delhi           58828
48  Female  Hyderabad           28420
HR
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
18          19  Employee_19         HR                 2             PhD   32
23          24  Employee_24         HR                15          Master   48
24          25  Employee_25         HR                 8     High School   34
33          34  Employee_34         HR                15        Bachelor   53
38          39  Employee_39         HR                 1          Master   24
41          42  Employee_42         HR                11             PhD   23
45          46  Employee_46         HR                 3             PhD   54

    Gender       City  Monthly_Salary
18    Male    Chennai           55746
23    Male  Bangalore           64790
24  Female  Bangalore          132455
33  Female      Delhi          134616
38    Male     Mumbai           43589
41    Male    Chennai           61212
45  Female  Hyderabad           88208
IT
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
2            3   Employee_3         IT                12     High School   51
6            7   Employee_7         IT                14             PhD   57
7            8   Employee_8         IT                17             PhD   34
8            9   Employee_9         IT                 4        Bachelor   53
11          12  Employee_12         IT                 4          Master   49
25          26  Employee_26         IT                14          Master   24
26          27  Employee_27         IT                 8        Bachelor   27
30          31  Employee_31         IT                15        Bachelor   54
34          35  Employee_35         IT                13          Master   53
36          37  Employee_37         IT                 7     High School   33

    Gender       City  Monthly_Salary
2   Female  Hyderabad           69064
6     Male     Mumbai           70525
7   Female  Bangalore           44830
8     Male  Hyderabad           42429
11  Female  Hyderabad          104909
25    Male  Hyderabad           30600
26  Female      Delhi          119660
30  Female  Hyderabad           70714
34    Male  Bangalore          130983
36    Male    Chennai           81491
Marketing
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
0            1   Employee_1  Marketing                15          Master   53
10          11  Employee_11  Marketing                 8             PhD   43
14          15  Employee_15  Marketing                10             PhD   49
16          17  Employee_17  Marketing                18          Master   41
19          20  Employee_20  Marketing                10        Bachelor   49
22          23  Employee_23  Marketing                16     High School   22
28          29  Employee_29  Marketing                13     High School   48
29          30  Employee_30  Marketing                18     High School   30
31          32  Employee_32  Marketing                13          Master   45
32          33  Employee_33  Marketing                 9          Master   36
40          41  Employee_41  Marketing                 8        Bachelor   23
42          43  Employee_43  Marketing                19     High School   49
49          50  Employee_50  Marketing                10     High School   47

    Gender       City  Monthly_Salary
0   Female      Delhi          111416
10    Male      Delhi          141381
14  Female     Mumbai           99290
16  Female  Hyderabad           30895
19    Male  Bangalore           74377
22    Male  Bangalore          122888
28    Male  Bangalore           65764
29    Male      Delhi           99543
31  Female  Hyderabad           81835
32    Male  Bangalore          127946
40  Female  Bangalore          107989
42  Female      Delhi           68525
49  Female  Bangalore          121752
Operations
    EmployeeID         Name  Department  Experience_Years Education_Level  \
1            2   Employee_2  Operations                 7        Bachelor
3            4   Employee_4  Operations                 8             PhD
4            5   Employee_5  Operations                15          Master
9           10  Employee_10  Operations                18     High School
12          13  Employee_13  Operations                 2          Master
17          18  Employee_18  Operations                12             PhD
21          22  Employee_22  Operations                14          Master
35          36  Employee_36  Operations                 1          Master
37          38  Employee_38  Operations                 9          Master
47          48  Employee_48  Operations                 1     High School

    Age  Gender       City  Monthly_Salary
1    25  Female  Bangalore           95271
3    44    Male      Delhi           95091
4    36  Female      Delhi          132450
9    28    Male     Mumbai           31893
12   23  Female  Hyderabad           72333
17   51  Female    Chennai           44738
21   54  Female      Delhi           79045
35   45  Female      Delhi           98744
37   23    Male     Mumbai          149123
47   40    Male    Chennai           43711

In [5]:
a['Monthly_Salary'].sum()

Department
Finance        672619
HR             580616
IT             765205
Marketing     1253601
Operations     842399
Name: Monthly_Salary, dtype: int64

In [6]:
pivot = df.pivot_table(
    index='Department',
    columns='Education_Level',
    values='EmployeeID',
    aggfunc='count',
    fill_value=0
)
pivot

Education_Level  Bachelor  High School  Master  PhD
Department
Finance                 2            2       5    1
HR                      1            1       2    3
IT                      3            2       3    2
Marketing               2            5       4    2
Operations              1            2       5    2

In [8]:
ipl_data = {'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','Royals'],
            'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
            'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,788,694,701,884,690],
            
           }
df2= pd.DataFrame(ipl_data)
df2

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690

In [9]:
df2.pivot_table(index='Team',columns='Year',aggfunc='count',fill_value=0,margins=True)

       Points                    Rank
Year     2014 2015 2016 2017 All 2014 2015 2016 2017 All
Team
Devils      1    1    0    0   2    1    1    0    0   2
Kings       1    1    1    1   4    1    1    1    1   4
Riders      1    1    1    0   3    1    1    1    0   3
Royals      1    1    0    1   3    1    1    0    1   3
All         4    4    2    2  12    4    4    2    2  12